FKDD_COPY_DIFF_3_2026-02-14/Catalogs/СкладыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СкладыКомпании</Name>
			<Comment>Склады (места хранения) компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Розничный</Name>
					<Comment>Истина - склад розничный, иначе - оптовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Comment>Тип цен розничной торговли (для розничного склада)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияСписанияПартийТоваровПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Comment>Обычный, Ордерный или Ордерный и ячеистый</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСклада</Name>
					<Comment>Длина склада в единицах размерности</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаСклада</Name>
					<Comment>Ширина склада в единицах размерности</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоУровней</Name>
					<Comment>Максимальное число уровней склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаРазмерности</Name>
					<Comment>Единица размерности для склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЕдиницИзмерения</Name>
					<Comment>Вариант учета единиц измерения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейкиПоУмолчанию</Name>
					<Comment>Длина ячейки по умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейкиПоУмолчанию</Name>
					<Comment>Ширина ячейки по умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходX</Name>
					<Comment>Координата X точка выхода склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходY</Name>
					<Comment>Координата Y точка выхода склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыходУровень</Name>
					<Comment>Координата Z точка выхода склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходY</Name>
					<Comment>Координата Y точка входа склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходX</Name>
					<Comment>Координата X точка входа склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходУровень</Name>
					<Comment>Координата Z точка входа склада</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаСклада</Name>
					<Comment>Сохраннная структура склада для отчета "карта склада"</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтделаДляККМ</Name>
					<Comment>Номер отдела который будет передаваться в ККМ (или фискальный регистратор) при печати чека</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_НеОтражатьВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_СкладНовыхАвтомобилей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_КатегорияСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_КатегорияСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ВидСкладаАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ВидыСкладовАвто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/СкладыКомпании/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	ПредопределенныйОсновнойСклад = Справочники.СкладыКомпании.ОсновнойСкладКомпании.ПолучитьОбъект();
	////ищем с таким же наименованием
	//Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	СкладыКомпании.Ссылка КАК СкладКомпанииСсылка
	//	|ИЗ
	//	|	Справочник.СкладыКомпании КАК СкладыКомпании
	//	|ГДЕ
	//	|	СкладыКомпании.Наименование = &Наименование И СкладыКомпании.ЭтоГруппа = Ложь И СкладыКомпании.Предопределенный = Ложь 
	//	|");
	//Запрос.УстановитьПараметр("Наименование",ПредопределенныйОсновнойСклад.Наименование);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Номер = 0;
	//Пока Выборка.Следующий() Цикл
	//	//заменяем
	//	ФормаЗаменаЗначений = Обработки.ПоискИЗаменаЗначений.ПолучитьФорму();
	//	ФормаЗаменаЗначений.Программно = Истина;
	//	СтрокаЗамены = ФормаЗаменаЗначений.ЗаменяемыеЗначения.Добавить();
	//	СтрокаЗамены.ЧтоЗаменять = Выборка.СкладКомпании;
	//	СтрокаЗамены.НаЧтоЗаменять = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
	//	СтрокаЗамены.Пометка = Истина;
	//	Сообщить("Справочник ""Склады компании"". Произведена замена ссылок на элемент """ + Выборка.СкладКомпании + """ ссылками на элемент """ + Справочники.СкладыКомпании.ОсновнойСкладКомпании + """");		
	//	ФормаЗаменаЗначений.Открыть();
	//	//
	//	ОбъектСклад = Выборка.СкладКомпании.ПолучитьОбъект();
	//	ОбъектСклад.Наименование = ПредопределенныйОсновнойСклад.Наименование+"_"+Номер;
	//	ОбъектСклад.Записать();
	//	Номер = Номер + 1;
	//КонецЦикла;
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		Если СтрДлина(СокрЛП(ПредопределенныйОсновнойСклад.Код))=1 Тогда
			ПредопределенныйОсновнойСклад.УстановитьНовыйКод();
		КонецЕсли;
		ПредопределенныйОсновнойСклад.Код=Формат(ПредопределенныйОсновнойСклад.Код,"ЧЦ=8; ЧВН=; ЧГ=");
		ПредопределенныйОсновнойСклад.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ПредопределенныйОсновнойСклад.Организация = Справочники.Организации.ОсновнаяОрганизация;
		ПредопределенныйОсновнойСклад.Розничный = Ложь;
		ПредопределенныйОсновнойСклад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
		Если Не обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы) Тогда
			ПредопределенныйОсновнойСклад.ГрафикРаботы = ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы;
		КонецЕсли;
	Иначе
		Если СтрДлина(СокрЛП(ПредопределенныйОсновнойСклад.Код))=1 Тогда
			ПредопределенныйОсновнойСклад.УстановитьНовыйКод();
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение) Тогда
			ПредопределенныйОсновнойСклад.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Организация) Тогда
			ПредопределенныйОсновнойСклад.Организация = Справочники.Организации.ОсновнаяОрганизация;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Розничный) Тогда
			ПредопределенныйОсновнойСклад.Розничный = Ложь;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.ВидСклада) Тогда
			ПредопределенныйОсновнойСклад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.ГрафикРаботы) Тогда
			Если Не обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы) Тогда
				ПредопределенныйОсновнойСклад.ГрафикРаботы = ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ПредопределенныйОсновнойСклад.ЭтоНовый();
	Если ПредопределенныйОсновнойСклад.Модифицированность() Тогда
		Попытка
			ПредопределенныйОсновнойСклад.Записать();
			Сообщить("Справочник ""Склады компании"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ПредопределенныйОсновнойСклад.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	// Заполним для всех складов реквизит "ВидСклада"
	ВыборкаСклады = Справочники.СкладыКомпании.Выбрать();
	Пока ВыборкаСклады.Следующий() Цикл
		Склад = ВыборкаСклады.ПолучитьОбъект();
		Если Склад.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли; 
		Если обЗначениеНеЗаполнено(Склад.ВидСклада) Тогда
			Склад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
			Попытка		
			    Склад.Записать();
				Сообщить("Справочник ""Склады компании"". Модифицирован элемент """+СокрЛП(Склад.Наименование)+"""");
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
